dataset_gen/Earlier_Datasets/OpenFoam_Shapes/Rectangle/design_points/design_point_2/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
9600
(
(-3.2950632 -7.3727591 0.5)
(-3.0475548 -7.3727591 0.5)
(-2.8000464 -7.3727591 0.5)
(-2.552538 -7.3727591 0.5)
(-2.3050296 -7.3727591 0.5)
(-2.0575212 -7.3727591 0.5)
(-1.8100127 -7.3727591 0.5)
(-1.5625043 -7.3727591 0.5)
...
)
;

boundaryField
{
    FrontBack
    {
        type            empty;
    }
    Cylinder
    {
        type            calculated;
        value           nonuniform List<vector> 
160
(
(0.55635089 2.7136612 0.5)
(0.60635089 2.7136612 0.5)
(0.65635089 2.7136612 0.5)
(0.70635089 2.7136612 0.5)
(0.75635089 2.7136612 0.5)
(0.80635089 2.7136612 0.5)
(0.85635089 2.7136612 0.5)
(0.90635089 2.7136612 0.5)
...
)
;
    }
    Bottom
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(-3.3436491 -7.5 0.5)
(-3.0936491 -7.5 0.5)
(-2.8436491 -7.5 0.5)
(-2.5936491 -7.5 0.5)
(-2.3436491 -7.5 0.5)
(-2.0936491 -7.5 0.5)
(-1.8436491 -7.5 0.5)
(-1.5936491 -7.5 0.5)
...
)
;
    }
    Top
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(6.4063509 7.5 0.5)
(6.1563509 7.5 0.5)
(5.9063509 7.5 0.5)
(5.6563509 7.5 0.5)
(5.4063509 7.5 0.5)
(5.1563509 7.5 0.5)
(4.9063509 7.5 0.5)
(4.6563509 7.5 0.5)
...
)
;
    }
    Inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
40
(
(-15 7.3125 0.5)
(-15 6.9375 0.5)
(-15 6.5625 0.5)
(-15 6.1875 0.5)
(-15 5.8125 0.5)
(-15 5.4375 0.5)
(-15 5.0625 0.5)
(-15 4.6875 0.5)
...
)
;
    }
    Outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
40
(
(15 -7.3125 0.5)
(15 -6.9375 0.5)
(15 -6.5625 0.5)
(15 -6.1875 0.5)
(15 -5.8125 0.5)
(15 -5.4375 0.5)
(15 -5.0625 0.5)
(15 -4.6875 0.5)
...
)
;
    }
}


// ************************************************************************* //
